In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'col1': [1, 2, 3, 4], 'col2': [444, 555, 666, 444], 
                    'col3': ['abc', 'def', 'ghi', 'xyz']})

In [3]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [5]:
df.memory_usage()

Index    128
col1      32
col2      32
col3      32
dtype: int64

In [6]:
df['col2'].unique()
# unique devolve valores unicos e deixá-los em ordem

array([444, 555, 666], dtype=int64)

In [7]:
df['col2'].nunique()
# devolve a quantidade de valores únicos

3

In [9]:
df[['col2']].value_counts()
# devolve a quantidade de cada elemento

col2
444     2
555     1
666     1
dtype: int64

#### Aplicando funções

In [15]:
def comp(x):
    return x ** 2 + 3

In [16]:
df['col1'].apply(comp)
# joga os valores pra função comp e devolve o resultado

0     4
1     7
2    12
3    19
Name: col1, dtype: int64

In [18]:
df['col1_result'] = df['col1'].apply(comp)
df

   col1  col2 col3  col1_result
0     1   444  abc            4
1     2   555  def            7
2     3   666  ghi           12
3     4   444  xyz           19

In [19]:
df['col1'].apply(lambda x: x **2 + 4)

0     5
1     8
2    13
3    20
Name: col1, dtype: int64

In [20]:
df['col1'].sum()

10

In [21]:
df['col1'].product()

24

In [22]:
df['col1'].std()

1.2909944487358056

In [23]:
df['col1'].idxmax()
# devolve o maior valor contido no indice

3

In [24]:
df[df['col2'] == 444]

   col1  col2 col3  col1_result
0     1   444  abc            4
3     4   444  xyz           19

In [26]:
df[df['col2'] == 444]['col1'].sum()
# quando a coluna dois for igual a 444, somamos os valores da coluna 1

5

In [27]:
df.sort_values(by='col2')

   col1  col2 col3  col1_result
0     1   444  abc            4
3     4   444  xyz           19
1     2   555  def            7
2     3   666  ghi           12

In [28]:
data = pd.DataFrame({
    'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
    'B': ['one', 'one', 'two', 'two', 'one', 'one'],
    'C': ['x', 'y', 'x', 'y', 'x', 'y'],
    'D': [1, 3, 2, 5, 4, 1]
})

In [29]:
data

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [35]:
dict_map = {"one": "1", "two": "2"}

In [38]:
data['E'] = data['B'].map(dict_map)
data

     A    B  C  D  E
0  foo  one  x  1  1
1  foo  one  y  3  1
2  foo  two  x  2  2
3  bar  two  y  5  2
4  bar  one  x  4  1
5  bar  one  y  1  1

In [42]:
data.pivot_table(index='A', columns='C', values='E')

C      x     y
A
bar  1.0  10.5
foo  6.0   1.0

### SÉRIE TEMPORAL

In [44]:
tempo = 100

In [47]:
datas = pd.date_range(start='1/1/2022', periods= tempo)
datas

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06', '2022-01-07', '2022-01-08',
               '2022-01-09', '2022-01-10', '2022-01-11', '2022-01-12',
               '2022-01-13', '2022-01-14', '2022-01-15', '2022-01-16',
               '2022-01-17', '2022-01-18', '2022-01-19', '2022-01-20',
               '2022-01-21', '2022-01-22', '2022-01-23', '2022-01-24',
               '2022-01-25', '2022-01-26', '2022-01-27', '2022-01-28',
               '2022-01-29', '2022-01-30', '2022-01-31', '2022-02-01',
               '2022-02-02', '2022-02-03', '2022-02-04', '2022-02-05',
               '2022-02-06', '2022-02-07', '2022-02-08', '2022-02-09',
               '2022-02-10', '2022-02-11', '2022-02-12', '2022-02-13',
               '2022-02-14', '2022-02-15', '2022-02-16', '2022-02-17',
               '2022-02-18', '2022-02-19', '2022-02-20', '2022-02-21',
               '2022-02-22', '2022-02-23', '2022-02-24', '2022-02-25',
               '2022-02-26', '2022-02-27', '2022-02-28', '2022-03-01',
               '2022-03-02', '2022-03-03', '2022-03-04', '2022-03-05',
               '2022-03-06', '2022-03-07', '2022-03-08', '2022-03-09',
               '2022-03-10', '2022-03-11', '2022-03-12', '2022-03-13',
               '2022-03-14', '2022-03-15', '2022-03-16', '2022-03-17',
               '2022-03-18', '2022-03-19', '2022-03-20', '2022-03-21',
               '2022-03-22', '2022-03-23', '2022-03-24', '2022-03-25',
               '2022-03-26', '2022-03-27', '2022-03-28', '2022-03-29',
               '2022-03-30', '2022-03-31', '2022-04-01', '2022-04-02',
               '2022-04-03', '2022-04-04', '2022-04-05', '2022-04-06',
               '2022-04-07', '2022-04-08', '2022-04-09', '2022-04-10'],
              dtype='datetime64[ns]', freq='D')

In [51]:
df = pd.DataFrame(range(tempo), columns=["number"], index = datas)
df

            number
2022-01-01       0
2022-01-02       1
2022-01-03       2
2022-01-04       3
2022-01-05       4
...            ...
2022-04-06      95
2022-04-07      96
2022-04-08      97
2022-04-09      98
2022-04-10      99

[100 rows x 1 columns]

In [53]:
df.index

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06', '2022-01-07', '2022-01-08',
               '2022-01-09', '2022-01-10', '2022-01-11', '2022-01-12',
               '2022-01-13', '2022-01-14', '2022-01-15', '2022-01-16',
               '2022-01-17', '2022-01-18', '2022-01-19', '2022-01-20',
               '2022-01-21', '2022-01-22', '2022-01-23', '2022-01-24',
               '2022-01-25', '2022-01-26', '2022-01-27', '2022-01-28',
               '2022-01-29', '2022-01-30', '2022-01-31', '2022-02-01',
               '2022-02-02', '2022-02-03', '2022-02-04', '2022-02-05',
               '2022-02-06', '2022-02-07', '2022-02-08', '2022-02-09',
               '2022-02-10', '2022-02-11', '2022-02-12', '2022-02-13',
               '2022-02-14', '2022-02-15', '2022-02-16', '2022-02-17',
               '2022-02-18', '2022-02-19', '2022-02-20', '2022-02-21',
               '2022-02-22', '2022-02-23', '2022-02-24', '2022-02-25',
               '2022-02-26', '2022-02-27', '2022-02-28', '2022-03-01',
               '2022-03-02', '2022-03-03', '2022-03-04', '2022-03-05',
               '2022-03-06', '2022-03-07', '2022-03-08', '2022-03-09',
               '2022-03-10', '2022-03-11', '2022-03-12', '2022-03-13',
               '2022-03-14', '2022-03-15', '2022-03-16', '2022-03-17',
               '2022-03-18', '2022-03-19', '2022-03-20', '2022-03-21',
               '2022-03-22', '2022-03-23', '2022-03-24', '2022-03-25',
               '2022-03-26', '2022-03-27', '2022-03-28', '2022-03-29',
               '2022-03-30', '2022-03-31', '2022-04-01', '2022-04-02',
               '2022-04-03', '2022-04-04', '2022-04-05', '2022-04-06',
               '2022-04-07', '2022-04-08', '2022-04-09', '2022-04-10'],
              dtype='datetime64[ns]', freq='D')

In [54]:
df.index[0].day
# passo o indeice que eu quero e o dia

1

In [55]:
df.index[0].month

1

In [56]:
df.index[0].year

2022

In [57]:
df.index[0].hour

0

In [58]:
df[df.index.day == 10]
# pegar os valores somente quando o dia for igual a 10

            number
2022-01-10       9
2022-02-10      40
2022-03-10      68
2022-04-10      99

In [60]:
df['Dia'] = df.index.day
df

            number  Dia
2022-01-01       0    1
2022-01-02       1    2
2022-01-03       2    3
2022-01-04       3    4
2022-01-05       4    5
...            ...  ...
2022-04-06      95    6
2022-04-07      96    7
2022-04-08      97    8
2022-04-09      98    9
2022-04-10      99   10

[100 rows x 2 columns]

In [61]:
df['Mês'] = df.index.month
df

            number  Dia  Mês
2022-01-01       0    1    1
2022-01-02       1    2    1
2022-01-03       2    3    1
2022-01-04       3    4    1
2022-01-05       4    5    1
...            ...  ...  ...
2022-04-06      95    6    4
2022-04-07      96    7    4
2022-04-08      97    8    4
2022-04-09      98    9    4
2022-04-10      99   10    4

[100 rows x 3 columns]

In [62]:
df['Ano'] = df.index.year
df

            number  Dia  Mês   Ano
2022-01-01       0    1    1  2022
2022-01-02       1    2    1  2022
2022-01-03       2    3    1  2022
2022-01-04       3    4    1  2022
2022-01-05       4    5    1  2022
...            ...  ...  ...   ...
2022-04-06      95    6    4  2022
2022-04-07      96    7    4  2022
2022-04-08      97    8    4  2022
2022-04-09      98    9    4  2022
2022-04-10      99   10    4  2022

[100 rows x 4 columns]

In [64]:
df.head(50)

            number  Dia  Mês   Ano
2022-01-01       0    1    1  2022
2022-01-02       1    2    1  2022
2022-01-03       2    3    1  2022
2022-01-04       3    4    1  2022
2022-01-05       4    5    1  2022
2022-01-06       5    6    1  2022
2022-01-07       6    7    1  2022
2022-01-08       7    8    1  2022
2022-01-09       8    9    1  2022
2022-01-10       9   10    1  2022
2022-01-11      10   11    1  2022
2022-01-12      11   12    1  2022
2022-01-13      12   13    1  2022
2022-01-14      13   14    1  2022
2022-01-15      14   15    1  2022
2022-01-16      15   16    1  2022
2022-01-17      16   17    1  2022
2022-01-18      17   18    1  2022
2022-01-19      18   19    1  2022
2022-01-20      19   20    1  2022
2022-01-21      20   21    1  2022
2022-01-22      21   22    1  2022
2022-01-23      22   23    1  2022
2022-01-24      23   24    1  2022
2022-01-25      24   25    1  2022
2022-01-26      25   26    1  2022
2022-01-27      26   27    1  2022
2022-01-28      27   28    1  2022
2022-01-29      28   29    1  2022
2022-01-30      29   30    1  2022
2022-01-31      30   31    1  2022
2022-02-01      31    1    2  2022
2022-02-02      32    2    2  2022
2022-02-03      33    3    2  2022
2022-02-04      34    4    2  2022
2022-02-05      35    5    2  2022
2022-02-06      36    6    2  2022
2022-02-07      37    7    2  2022
2022-02-08      38    8    2  2022
2022-02-09      39    9    2  2022
2022-02-10      40   10    2  2022
2022-02-11      41   11    2  2022
2022-02-12      42   12    2  2022
2022-02-13      43   13    2  2022
2022-02-14      44   14    2  2022
2022-02-15      45   15    2  2022
2022-02-16      46   16    2  2022
2022-02-17      47   17    2  2022
2022-02-18      48   18    2  2022
2022-02-19      49   19    2  2022

In [65]:
import datetime

In [67]:
df[df.index > datetime.datetime(2022, 1, 30)]

            number  Dia  Mês   Ano
2022-01-31      30   31    1  2022
2022-02-01      31    1    2  2022
2022-02-02      32    2    2  2022
2022-02-03      33    3    2  2022
2022-02-04      34    4    2  2022
...            ...  ...  ...   ...
2022-04-06      95    6    4  2022
2022-04-07      96    7    4  2022
2022-04-08      97    8    4  2022
2022-04-09      98    9    4  2022
2022-04-10      99   10    4  2022

[70 rows x 4 columns]

#### Entrada e saída de dados